{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "UObjectDisplayNames",
			"Children": [
				{
					"Source": {
						"Text": "Add Rotation Input"
					},
					"Translation": {
						"Text": "Add Rotation Input"
					},
					"Key": "VRSimSpatialInputComponent:AddRotationInput"
				},
				{
					"Source": {
						"Text": "Add Translation Input"
					},
					"Translation": {
						"Text": "Add Translation Input"
					},
					"Key": "VRSimSpatialInputComponent:AddTranslationInput"
				},
				{
					"Source": {
						"Text": "Can Interact"
					},
					"Translation": {
						"Text": "Can Interact"
					},
					"Key": "VRSimInteractable:CanInteract"
				},
				{
					"Source": {
						"Text": "Clear Grabbed Target"
					},
					"Translation": {
						"Text": "Clear Grabbed Target"
					},
					"Key": "VRSimGrabComponent:ClearGrabbedTarget"
				},
				{
					"Source": {
						"Text": "Clear Selected Target"
					},
					"Translation": {
						"Text": "Clear Selected Target"
					},
					"Key": "VRSimInteractionComponent:ClearSelectedTarget"
				},
				{
					"Source": {
						"Text": "Clear Teleport Destination"
					},
					"Translation": {
						"Text": "Clear Teleport Destination"
					},
					"Key": "VRSimTeleportComponent:ClearTeleportDestination"
				},
				{
					"Source": {
						"Text": "Controller Proxy"
					},
					"Translation": {
						"Text": "Controller Proxy"
					},
					"Key": "VRSimInteractionComponent:ControllerProxy"
				},
				{
					"Source": {
						"Text": "Controller Proxy"
					},
					"Translation": {
						"Text": "Controller Proxy"
					},
					"Key": "VRSimSpatialInputComponent:ControllerProxy"
				},
				{
					"Source": {
						"Text": "Controller Proxy"
					},
					"Translation": {
						"Text": "Controller Proxy"
					},
					"Key": "VRSimTeleportComponent:ControllerProxy"
				},
				{
					"Source": {
						"Text": "Controller Proxy"
					},
					"Translation": {
						"Text": "Controller Proxy"
					},
					"Key": "VRSimToolAdapterComponent:ControllerProxy"
				},
				{
					"Source": {
						"Text": "Debug Direction Length"
					},
					"Translation": {
						"Text": "Debug Direction Length"
					},
					"Key": "VRSimControllerProxyComponent:DebugDirectionLength"
				},
				{
					"Source": {
						"Text": "Debug Interaction"
					},
					"Translation": {
						"Text": "Debug Interaction"
					},
					"Key": "VRSimControllerProxyComponent:bDebugInteraction"
				},
				{
					"Source": {
						"Text": "Debug Interaction"
					},
					"Translation": {
						"Text": "Debug Interaction"
					},
					"Key": "VRSimInteractionComponent:bDebugInteraction"
				},
				{
					"Source": {
						"Text": "Debug Interaction"
					},
					"Translation": {
						"Text": "Debug Interaction"
					},
					"Key": "VRSimTeleportComponent:bDebugInteraction"
				},
				{
					"Source": {
						"Text": "Delta Time"
					},
					"Translation": {
						"Text": "Delta Time"
					},
					"Key": "VRSimGrabComponent:UpdateManipulation:DeltaTime"
				},
				{
					"Source": {
						"Text": "Delta Time"
					},
					"Translation": {
						"Text": "Delta Time"
					},
					"Key": "VRSimInteractionComponent:UpdateDetection:DeltaTime"
				},
				{
					"Source": {
						"Text": "Delta Time"
					},
					"Translation": {
						"Text": "Delta Time"
					},
					"Key": "VRSimSpatialInputComponent:AddRotationInput:DeltaTime"
				},
				{
					"Source": {
						"Text": "Delta Time"
					},
					"Translation": {
						"Text": "Delta Time"
					},
					"Key": "VRSimSpatialInputComponent:AddTranslationInput:DeltaTime"
				},
				{
					"Source": {
						"Text": "Delta Time"
					},
					"Translation": {
						"Text": "Delta Time"
					},
					"Key": "VRSimTeleportComponent:UpdateDestination:DeltaTime"
				},
				{
					"Source": {
						"Text": "Destination"
					},
					"Translation": {
						"Text": "Destination"
					},
					"Key": "VRSimFeedbackComponent:PlayDestinationFeedback:Destination"
				},
				{
					"Source": {
						"Text": "Destination"
					},
					"Translation": {
						"Text": "Destination"
					},
					"Key": "VRSimTeleportComponent:SetTeleportDestination:Destination"
				},
				{
					"Source": {
						"Text": "Destination Point"
					},
					"Translation": {
						"Text": "Destination Point"
					},
					"Key": "VRSimPortalBase:DestinationPoint"
				},
				{
					"Source": {
						"Text": "Destination Valid"
					},
					"Translation": {
						"Text": "Destination Valid"
					},
					"Key": "VRSimTeleportComponent:bDestinationValid"
				},
				{
					"Source": {
						"Text": "Draw Near Interaction Debug"
					},
					"Translation": {
						"Text": "Draw Near Interaction Debug"
					},
					"Key": "VRSimNearInteractionComponent:DrawNearInteractionDebug"
				},
				{
					"Source": {
						"Text": "Draw Ray Debug"
					},
					"Translation": {
						"Text": "Draw Ray Debug"
					},
					"Key": "VRSimRayInteractionComponent:DrawRayDebug"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "Enabled"
					},
					"Key": "VRSimControllerProxyComponent:SetDebugEnabled:bEnabled"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "Enabled"
					},
					"Key": "VRSimFeedbackComponent:SetFeedbackEnabled:bEnabled"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "Enabled"
					},
					"Key": "VRSimInteractableTarget:SetInteractionEnabled:bEnabled"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "Enabled"
					},
					"Key": "VRSimInteractionComponent:SetDebugEnabled:bEnabled"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "Enabled"
					},
					"Key": "VRSimPortalBase:SetPortalEnabled:bEnabled"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "Enabled"
					},
					"Key": "VRSimSpatialInputComponent:SetSpatialInputEnabled:bEnabled"
				},
				{
					"Source": {
						"Text": "Enabled"
					},
					"Translation": {
						"Text": "Enabled"
					},
					"Key": "VRSimTeleportComponent:SetDebugEnabled:bEnabled"
				},
				{
					"Source": {
						"Text": "End"
					},
					"Translation": {
						"Text": "End"
					},
					"Key": "VRSimRayInteractionComponent:DrawRayDebug:End"
				},
				{
					"Source": {
						"Text": "Execute Primary Action"
					},
					"Translation": {
						"Text": "Execute Primary Action"
					},
					"Key": "VRSimToolAdapterComponent:ExecutePrimaryAction"
				},
				{
					"Source": {
						"Text": "Execute Secondary Action"
					},
					"Translation": {
						"Text": "Execute Secondary Action"
					},
					"Key": "VRSimToolAdapterComponent:ExecuteSecondaryAction"
				},
				{
					"Source": {
						"Text": "Feedback Enabled"
					},
					"Translation": {
						"Text": "Feedback Enabled"
					},
					"Key": "VRSimFeedbackComponent:bFeedbackEnabled"
				},
				{
					"Source": {
						"Text": "Get Action Direction"
					},
					"Translation": {
						"Text": "Get Action Direction"
					},
					"Key": "VRSimToolAdapterComponent:GetActionDirection"
				},
				{
					"Source": {
						"Text": "Get Action Origin"
					},
					"Translation": {
						"Text": "Get Action Origin"
					},
					"Key": "VRSimToolAdapterComponent:GetActionOrigin"
				},
				{
					"Source": {
						"Text": "Get Candidate Target"
					},
					"Translation": {
						"Text": "Get Candidate Target"
					},
					"Key": "VRSimGrabComponent:GetCandidateTarget"
				},
				{
					"Source": {
						"Text": "Get Controller Proxy"
					},
					"Translation": {
						"Text": "Get Controller Proxy"
					},
					"Key": "VRSimInteractionComponent:GetControllerProxy"
				},
				{
					"Source": {
						"Text": "Get Controller Proxy"
					},
					"Translation": {
						"Text": "Get Controller Proxy"
					},
					"Key": "VRSimSpatialInputComponent:GetControllerProxy"
				},
				{
					"Source": {
						"Text": "Get Controller Proxy"
					},
					"Translation": {
						"Text": "Get Controller Proxy"
					},
					"Key": "VRSimTeleportComponent:GetControllerProxy"
				},
				{
					"Source": {
						"Text": "Get Controller Proxy"
					},
					"Translation": {
						"Text": "Get Controller Proxy"
					},
					"Key": "VRSimToolAdapterComponent:GetControllerProxy"
				},
				{
					"Source": {
						"Text": "Get Destination Transform"
					},
					"Translation": {
						"Text": "Get Destination Transform"
					},
					"Key": "VRSimPortalBase:GetDestinationTransform"
				},
				{
					"Source": {
						"Text": "Get Forward Direction"
					},
					"Translation": {
						"Text": "Get Forward Direction"
					},
					"Key": "VRSimControllerProxyComponent:GetForwardDirection"
				},
				{
					"Source": {
						"Text": "Get Grab Attach Transform"
					},
					"Translation": {
						"Text": "Get Grab Attach Transform"
					},
					"Key": "VRSimControllerProxyComponent:GetGrabAttachTransform"
				},
				{
					"Source": {
						"Text": "Get Grab Attach Transform"
					},
					"Translation": {
						"Text": "Get Grab Attach Transform"
					},
					"Key": "VRSimGrabComponent:GetGrabAttachTransform"
				},
				{
					"Source": {
						"Text": "Get Grabbed Target"
					},
					"Translation": {
						"Text": "Get Grabbed Target"
					},
					"Key": "VRSimGrabComponent:GetGrabbedTarget"
				},
				{
					"Source": {
						"Text": "Get Interaction Component"
					},
					"Translation": {
						"Text": "Get Interaction Component"
					},
					"Key": "VRSimGrabComponent:GetInteractionComponent"
				},
				{
					"Source": {
						"Text": "Get Interaction Direction"
					},
					"Translation": {
						"Text": "Get Interaction Direction"
					},
					"Key": "VRSimInteractionComponent:GetInteractionDirection"
				},
				{
					"Source": {
						"Text": "Get Interaction Origin"
					},
					"Translation": {
						"Text": "Get Interaction Origin"
					},
					"Key": "VRSimInteractionComponent:GetInteractionOrigin"
				},
				{
					"Source": {
						"Text": "Get Near Interaction Origin"
					},
					"Translation": {
						"Text": "Get Near Interaction Origin"
					},
					"Key": "VRSimControllerProxyComponent:GetNearInteractionOrigin"
				},
				{
					"Source": {
						"Text": "Get Near Interaction Origin"
					},
					"Translation": {
						"Text": "Get Near Interaction Origin"
					},
					"Key": "VRSimNearInteractionComponent:GetNearInteractionOrigin"
				},
				{
					"Source": {
						"Text": "Get Ray End"
					},
					"Translation": {
						"Text": "Get Ray End"
					},
					"Key": "VRSimRayInteractionComponent:GetRayEnd"
				},
				{
					"Source": {
						"Text": "Get Ray Origin"
					},
					"Translation": {
						"Text": "Get Ray Origin"
					},
					"Key": "VRSimControllerProxyComponent:GetRayOrigin"
				},
				{
					"Source": {
						"Text": "Get Ray Start"
					},
					"Translation": {
						"Text": "Get Ray Start"
					},
					"Key": "VRSimRayInteractionComponent:GetRayStart"
				},
				{
					"Source": {
						"Text": "Get Selected Target"
					},
					"Translation": {
						"Text": "Get Selected Target"
					},
					"Key": "VRSimInteractionComponent:GetSelectedTarget"
				},
				{
					"Source": {
						"Text": "Get Teleport Destination"
					},
					"Translation": {
						"Text": "Get Teleport Destination"
					},
					"Key": "VRSimTeleportComponent:GetTeleportDestination"
				},
				{
					"Source": {
						"Text": "Get Teleport Direction"
					},
					"Translation": {
						"Text": "Get Teleport Direction"
					},
					"Key": "VRSimTeleportComponent:GetTeleportDirection"
				},
				{
					"Source": {
						"Text": "Get Teleport Origin"
					},
					"Translation": {
						"Text": "Get Teleport Origin"
					},
					"Key": "VRSimTeleportComponent:GetTeleportOrigin"
				},
				{
					"Source": {
						"Text": "Get World Position"
					},
					"Translation": {
						"Text": "Get World Position"
					},
					"Key": "VRSimControllerProxyComponent:GetWorldPosition"
				},
				{
					"Source": {
						"Text": "Get World Rotation"
					},
					"Translation": {
						"Text": "Get World Rotation"
					},
					"Key": "VRSimControllerProxyComponent:GetWorldRotation"
				},
				{
					"Source": {
						"Text": "Grab Attach Offset"
					},
					"Translation": {
						"Text": "Grab Attach Offset"
					},
					"Key": "VRSimControllerProxyComponent:GrabAttachOffset"
				},
				{
					"Source": {
						"Text": "Grabbed Target"
					},
					"Translation": {
						"Text": "Grabbed Target"
					},
					"Key": "VRSimGrabComponent:GrabbedTarget"
				},
				{
					"Source": {
						"Text": "Has Destination"
					},
					"Translation": {
						"Text": "Has Destination"
					},
					"Key": "VRSimTeleportComponent:bHasDestination"
				},
				{
					"Source": {
						"Text": "Has Valid Teleport Destination"
					},
					"Translation": {
						"Text": "Has Valid Teleport Destination"
					},
					"Key": "VRSimTeleportComponent:HasValidTeleportDestination"
				},
				{
					"Source": {
						"Text": "Hit Result"
					},
					"Translation": {
						"Text": "Hit Result"
					},
					"Key": "VRSimRayInteractionComponent:DrawRayDebug:HitResult"
				},
				{
					"Source": {
						"Text": "In Controller Proxy"
					},
					"Translation": {
						"Text": "In Controller Proxy"
					},
					"Key": "VRSimInteractionComponent:SetControllerProxy:InControllerProxy"
				},
				{
					"Source": {
						"Text": "In Controller Proxy"
					},
					"Translation": {
						"Text": "In Controller Proxy"
					},
					"Key": "VRSimSpatialInputComponent:SetControllerProxy:InControllerProxy"
				},
				{
					"Source": {
						"Text": "In Controller Proxy"
					},
					"Translation": {
						"Text": "In Controller Proxy"
					},
					"Key": "VRSimTeleportComponent:SetControllerProxy:InControllerProxy"
				},
				{
					"Source": {
						"Text": "In Controller Proxy"
					},
					"Translation": {
						"Text": "In Controller Proxy"
					},
					"Key": "VRSimToolAdapterComponent:SetControllerProxy:InControllerProxy"
				},
				{
					"Source": {
						"Text": "In Interaction Component"
					},
					"Translation": {
						"Text": "In Interaction Component"
					},
					"Key": "VRSimGrabComponent:SetInteractionComponent:InInteractionComponent"
				},
				{
					"Source": {
						"Text": "Input"
					},
					"Translation": {
						"Text": "Input"
					},
					"Key": "VRSimSpatialInputComponent:AddRotationInput:Input"
				},
				{
					"Source": {
						"Text": "Input"
					},
					"Translation": {
						"Text": "Input"
					},
					"Key": "VRSimSpatialInputComponent:AddTranslationInput:Input"
				},
				{
					"Source": {
						"Text": "Interact"
					},
					"Translation": {
						"Text": "Interact"
					},
					"Key": "VRSimInteractable:Interact"
				},
				{
					"Source": {
						"Text": "Interaction Component"
					},
					"Translation": {
						"Text": "Interaction Component"
					},
					"Key": "VRSimGrabComponent:InteractionComponent"
				},
				{
					"Source": {
						"Text": "Interaction Enabled"
					},
					"Translation": {
						"Text": "Interaction Enabled"
					},
					"Key": "VRSimInteractableTarget:bInteractionEnabled"
				},
				{
					"Source": {
						"Text": "Interaction Radius"
					},
					"Translation": {
						"Text": "Interaction Radius"
					},
					"Key": "VRSimNearInteractionComponent:InteractionRadius"
				},
				{
					"Source": {
						"Text": "Interaction Source"
					},
					"Translation": {
						"Text": "Interaction Source"
					},
					"Key": "VRSimInteractable:CanInteract:InteractionSource"
				},
				{
					"Source": {
						"Text": "Interaction Source"
					},
					"Translation": {
						"Text": "Interaction Source"
					},
					"Key": "VRSimInteractable:Interact:InteractionSource"
				},
				{
					"Source": {
						"Text": "Interaction Source"
					},
					"Translation": {
						"Text": "Interaction Source"
					},
					"Key": "VRSimInteractable:OnDeselected:InteractionSource"
				},
				{
					"Source": {
						"Text": "Interaction Source"
					},
					"Translation": {
						"Text": "Interaction Source"
					},
					"Key": "VRSimInteractable:OnSelected:InteractionSource"
				},
				{
					"Source": {
						"Text": "Interaction Source"
					},
					"Translation": {
						"Text": "Interaction Source"
					},
					"Key": "VRSimInteractableTarget:ReceiveInteraction:InteractionSource"
				},
				{
					"Source": {
						"Text": "Interaction Source"
					},
					"Translation": {
						"Text": "Interaction Source"
					},
					"Key": "VRSimInteractableTarget:ReceiveSelectionChanged:InteractionSource"
				},
				{
					"Source": {
						"Text": "Is Debug Enabled"
					},
					"Translation": {
						"Text": "Is Debug Enabled"
					},
					"Key": "VRSimControllerProxyComponent:IsDebugEnabled"
				},
				{
					"Source": {
						"Text": "Is Debug Enabled"
					},
					"Translation": {
						"Text": "Is Debug Enabled"
					},
					"Key": "VRSimInteractionComponent:IsDebugEnabled"
				},
				{
					"Source": {
						"Text": "Is Feedback Enabled"
					},
					"Translation": {
						"Text": "Is Feedback Enabled"
					},
					"Key": "VRSimFeedbackComponent:IsFeedbackEnabled"
				},
				{
					"Source": {
						"Text": "Is Grabbing"
					},
					"Translation": {
						"Text": "Is Grabbing"
					},
					"Key": "VRSimGrabComponent:IsGrabbing"
				},
				{
					"Source": {
						"Text": "Is Interactable Target"
					},
					"Translation": {
						"Text": "Is Interactable Target"
					},
					"Key": "VRSimInteractionComponent:IsInteractableTarget"
				},
				{
					"Source": {
						"Text": "Is Portal Enabled"
					},
					"Translation": {
						"Text": "Is Portal Enabled"
					},
					"Key": "VRSimPortalBase:IsPortalEnabled"
				},
				{
					"Source": {
						"Text": "Is Selected"
					},
					"Translation": {
						"Text": "Is Selected"
					},
					"Key": "VRSimInteractableTarget:IsSelected"
				},
				{
					"Source": {
						"Text": "Is Selected"
					},
					"Translation": {
						"Text": "Is Selected"
					},
					"Key": "VRSimInteractableTarget:ReceiveSelectionChanged:bIsSelected"
				},
				{
					"Source": {
						"Text": "Is Spatial Input Enabled"
					},
					"Translation": {
						"Text": "Is Spatial Input Enabled"
					},
					"Key": "VRSimSpatialInputComponent:IsSpatialInputEnabled"
				},
				{
					"Source": {
						"Text": "Near Interaction Origin Offset"
					},
					"Translation": {
						"Text": "Near Interaction Origin Offset"
					},
					"Key": "VRSimControllerProxyComponent:NearInteractionOriginOffset"
				},
				{
					"Source": {
						"Text": "Near Interaction Radius"
					},
					"Translation": {
						"Text": "Near Interaction Radius"
					},
					"Key": "VRSimControllerProxyComponent:NearInteractionRadius"
				},
				{
					"Source": {
						"Text": "On Deselected"
					},
					"Translation": {
						"Text": "On Deselected"
					},
					"Key": "VRSimInteractable:OnDeselected"
				},
				{
					"Source": {
						"Text": "On Interaction"
					},
					"Translation": {
						"Text": "On Interaction"
					},
					"Key": "VRSimInteractableTarget:ReceiveInteraction"
				},
				{
					"Source": {
						"Text": "On Selected"
					},
					"Translation": {
						"Text": "On Selected"
					},
					"Key": "VRSimInteractable:OnSelected"
				},
				{
					"Source": {
						"Text": "On Selection Changed"
					},
					"Translation": {
						"Text": "On Selection Changed"
					},
					"Key": "VRSimInteractableTarget:ReceiveSelectionChanged"
				},
				{
					"Source": {
						"Text": "Play Destination Feedback"
					},
					"Translation": {
						"Text": "Play Destination Feedback"
					},
					"Key": "VRSimFeedbackComponent:PlayDestinationFeedback"
				},
				{
					"Source": {
						"Text": "Play Interaction Feedback"
					},
					"Translation": {
						"Text": "Play Interaction Feedback"
					},
					"Key": "VRSimFeedbackComponent:PlayInteractionFeedback"
				},
				{
					"Source": {
						"Text": "Play Selection Feedback"
					},
					"Translation": {
						"Text": "Play Selection Feedback"
					},
					"Key": "VRSimFeedbackComponent:PlaySelectionFeedback"
				},
				{
					"Source": {
						"Text": "Portal Enabled"
					},
					"Translation": {
						"Text": "Portal Enabled"
					},
					"Key": "VRSimPortalBase:bPortalEnabled"
				},
				{
					"Source": {
						"Text": "Ray Origin Offset"
					},
					"Translation": {
						"Text": "Ray Origin Offset"
					},
					"Key": "VRSimControllerProxyComponent:RayOriginOffset"
				},
				{
					"Source": {
						"Text": "Reset Proxy Pose"
					},
					"Translation": {
						"Text": "Reset Proxy Pose"
					},
					"Key": "VRSimSpatialInputComponent:ResetProxyPose"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimControllerProxyComponent:GetForwardDirection:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimControllerProxyComponent:GetGrabAttachTransform:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimControllerProxyComponent:GetNearInteractionOrigin:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimControllerProxyComponent:GetRayOrigin:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimControllerProxyComponent:GetWorldPosition:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimControllerProxyComponent:GetWorldRotation:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimControllerProxyComponent:IsDebugEnabled:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimFeedbackComponent:IsFeedbackEnabled:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimGrabComponent:GetCandidateTarget:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimGrabComponent:GetGrabAttachTransform:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimGrabComponent:GetGrabbedTarget:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimGrabComponent:GetInteractionComponent:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimGrabComponent:IsGrabbing:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimGrabComponent:SetGrabbedTarget:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimGrabComponent:TryGrab:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimGrabComponent:TryRelease:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractable:CanInteract:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractableTarget:IsSelected:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractionComponent:GetControllerProxy:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractionComponent:GetInteractionDirection:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractionComponent:GetInteractionOrigin:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractionComponent:GetSelectedTarget:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractionComponent:IsDebugEnabled:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractionComponent:IsInteractableTarget:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractionComponent:SetSelectedTarget:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimInteractionComponent:TryInteract:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimNearInteractionComponent:GetNearInteractionOrigin:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimPortalBase:GetDestinationTransform:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimPortalBase:IsPortalEnabled:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimPortalBase:TryActivatePortal:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimRayInteractionComponent:GetRayEnd:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimRayInteractionComponent:GetRayStart:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimSpatialInputComponent:GetControllerProxy:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimSpatialInputComponent:IsSpatialInputEnabled:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimTeleportComponent:GetControllerProxy:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimTeleportComponent:GetTeleportDestination:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimTeleportComponent:GetTeleportDirection:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimTeleportComponent:GetTeleportOrigin:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimTeleportComponent:HasValidTeleportDestination:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimTeleportComponent:TryTeleport:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimToolAdapterComponent:ExecutePrimaryAction:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimToolAdapterComponent:ExecuteSecondaryAction:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimToolAdapterComponent:GetActionDirection:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimToolAdapterComponent:GetActionOrigin:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "VRSimToolAdapterComponent:GetControllerProxy:ReturnValue"
				},
				{
					"Source": {
						"Text": "Rotation Speed"
					},
					"Translation": {
						"Text": "Rotation Speed"
					},
					"Key": "VRSimSpatialInputComponent:RotationSpeed"
				},
				{
					"Source": {
						"Text": "Selected"
					},
					"Translation": {
						"Text": "Selected"
					},
					"Key": "VRSimFeedbackComponent:PlaySelectionFeedback:bSelected"
				},
				{
					"Source": {
						"Text": "Selected"
					},
					"Translation": {
						"Text": "Selected"
					},
					"Key": "VRSimInteractableTarget:bSelected"
				},
				{
					"Source": {
						"Text": "Selected Target"
					},
					"Translation": {
						"Text": "Selected Target"
					},
					"Key": "VRSimInteractionComponent:SelectedTarget"
				},
				{
					"Source": {
						"Text": "Set Controller Proxy"
					},
					"Translation": {
						"Text": "Set Controller Proxy"
					},
					"Key": "VRSimInteractionComponent:SetControllerProxy"
				},
				{
					"Source": {
						"Text": "Set Controller Proxy"
					},
					"Translation": {
						"Text": "Set Controller Proxy"
					},
					"Key": "VRSimSpatialInputComponent:SetControllerProxy"
				},
				{
					"Source": {
						"Text": "Set Controller Proxy"
					},
					"Translation": {
						"Text": "Set Controller Proxy"
					},
					"Key": "VRSimTeleportComponent:SetControllerProxy"
				},
				{
					"Source": {
						"Text": "Set Controller Proxy"
					},
					"Translation": {
						"Text": "Set Controller Proxy"
					},
					"Key": "VRSimToolAdapterComponent:SetControllerProxy"
				},
				{
					"Source": {
						"Text": "Set Debug Enabled"
					},
					"Translation": {
						"Text": "Set Debug Enabled"
					},
					"Key": "VRSimControllerProxyComponent:SetDebugEnabled"
				},
				{
					"Source": {
						"Text": "Set Debug Enabled"
					},
					"Translation": {
						"Text": "Set Debug Enabled"
					},
					"Key": "VRSimInteractionComponent:SetDebugEnabled"
				},
				{
					"Source": {
						"Text": "Set Debug Enabled"
					},
					"Translation": {
						"Text": "Set Debug Enabled"
					},
					"Key": "VRSimTeleportComponent:SetDebugEnabled"
				},
				{
					"Source": {
						"Text": "Set Feedback Enabled"
					},
					"Translation": {
						"Text": "Set Feedback Enabled"
					},
					"Key": "VRSimFeedbackComponent:SetFeedbackEnabled"
				},
				{
					"Source": {
						"Text": "Set Grabbed Target"
					},
					"Translation": {
						"Text": "Set Grabbed Target"
					},
					"Key": "VRSimGrabComponent:SetGrabbedTarget"
				},
				{
					"Source": {
						"Text": "Set Interaction Component"
					},
					"Translation": {
						"Text": "Set Interaction Component"
					},
					"Key": "VRSimGrabComponent:SetInteractionComponent"
				},
				{
					"Source": {
						"Text": "Set Interaction Enabled"
					},
					"Translation": {
						"Text": "Set Interaction Enabled"
					},
					"Key": "VRSimInteractableTarget:SetInteractionEnabled"
				},
				{
					"Source": {
						"Text": "Set Portal Enabled"
					},
					"Translation": {
						"Text": "Set Portal Enabled"
					},
					"Key": "VRSimPortalBase:SetPortalEnabled"
				},
				{
					"Source": {
						"Text": "Set Selected Target"
					},
					"Translation": {
						"Text": "Set Selected Target"
					},
					"Key": "VRSimInteractionComponent:SetSelectedTarget"
				},
				{
					"Source": {
						"Text": "Set Spatial Input Enabled"
					},
					"Translation": {
						"Text": "Set Spatial Input Enabled"
					},
					"Key": "VRSimSpatialInputComponent:SetSpatialInputEnabled"
				},
				{
					"Source": {
						"Text": "Set Teleport Destination"
					},
					"Translation": {
						"Text": "Set Teleport Destination"
					},
					"Key": "VRSimTeleportComponent:SetTeleportDestination"
				},
				{
					"Source": {
						"Text": "Spatial Input Enabled"
					},
					"Translation": {
						"Text": "Spatial Input Enabled"
					},
					"Key": "VRSimSpatialInputComponent:bSpatialInputEnabled"
				},
				{
					"Source": {
						"Text": "Start"
					},
					"Translation": {
						"Text": "Start"
					},
					"Key": "VRSimRayInteractionComponent:DrawRayDebug:Start"
				},
				{
					"Source": {
						"Text": "Succeeded"
					},
					"Translation": {
						"Text": "Succeeded"
					},
					"Key": "VRSimFeedbackComponent:PlayInteractionFeedback:bSucceeded"
				},
				{
					"Source": {
						"Text": "Target"
					},
					"Translation": {
						"Text": "Target"
					},
					"Key": "VRSimFeedbackComponent:PlayInteractionFeedback:Target"
				},
				{
					"Source": {
						"Text": "Target"
					},
					"Translation": {
						"Text": "Target"
					},
					"Key": "VRSimFeedbackComponent:PlaySelectionFeedback:Target"
				},
				{
					"Source": {
						"Text": "Target"
					},
					"Translation": {
						"Text": "Target"
					},
					"Key": "VRSimGrabComponent:SetGrabbedTarget:Target"
				},
				{
					"Source": {
						"Text": "Target"
					},
					"Translation": {
						"Text": "Target"
					},
					"Key": "VRSimInteractionComponent:IsInteractableTarget:Target"
				},
				{
					"Source": {
						"Text": "Target"
					},
					"Translation": {
						"Text": "Target"
					},
					"Key": "VRSimInteractionComponent:SetSelectedTarget:Target"
				},
				{
					"Source": {
						"Text": "Target Actor"
					},
					"Translation": {
						"Text": "Target Actor"
					},
					"Key": "VRSimTeleportComponent:TryTeleport:TargetActor"
				},
				{
					"Source": {
						"Text": "Target Mesh"
					},
					"Translation": {
						"Text": "Target Mesh"
					},
					"Key": "VRSimInteractableTarget:TargetMesh"
				},
				{
					"Source": {
						"Text": "Teleport Destination"
					},
					"Translation": {
						"Text": "Teleport Destination"
					},
					"Key": "VRSimTeleportComponent:TeleportDestination"
				},
				{
					"Source": {
						"Text": "Trace Channel"
					},
					"Translation": {
						"Text": "Trace Channel"
					},
					"Key": "VRSimRayInteractionComponent:TraceChannel"
				},
				{
					"Source": {
						"Text": "Trace Distance"
					},
					"Translation": {
						"Text": "Trace Distance"
					},
					"Key": "VRSimRayInteractionComponent:TraceDistance"
				},
				{
					"Source": {
						"Text": "Translation Speed"
					},
					"Translation": {
						"Text": "Translation Speed"
					},
					"Key": "VRSimSpatialInputComponent:TranslationSpeed"
				},
				{
					"Source": {
						"Text": "Traveler"
					},
					"Translation": {
						"Text": "Traveler"
					},
					"Key": "VRSimPortalBase:TryActivatePortal:Traveler"
				},
				{
					"Source": {
						"Text": "Try Activate Portal"
					},
					"Translation": {
						"Text": "Try Activate Portal"
					},
					"Key": "VRSimPortalBase:TryActivatePortal"
				},
				{
					"Source": {
						"Text": "Try Grab"
					},
					"Translation": {
						"Text": "Try Grab"
					},
					"Key": "VRSimGrabComponent:TryGrab"
				},
				{
					"Source": {
						"Text": "Try Interact"
					},
					"Translation": {
						"Text": "Try Interact"
					},
					"Key": "VRSimInteractionComponent:TryInteract"
				},
				{
					"Source": {
						"Text": "Try Release"
					},
					"Translation": {
						"Text": "Try Release"
					},
					"Key": "VRSimGrabComponent:TryRelease"
				},
				{
					"Source": {
						"Text": "Try Teleport"
					},
					"Translation": {
						"Text": "Try Teleport"
					},
					"Key": "VRSimTeleportComponent:TryTeleport"
				},
				{
					"Source": {
						"Text": "Update Destination"
					},
					"Translation": {
						"Text": "Update Destination"
					},
					"Key": "VRSimTeleportComponent:UpdateDestination"
				},
				{
					"Source": {
						"Text": "Update Detection"
					},
					"Translation": {
						"Text": "Update Detection"
					},
					"Key": "VRSimInteractionComponent:UpdateDetection"
				},
				{
					"Source": {
						"Text": "Update Manipulation"
					},
					"Translation": {
						"Text": "Update Manipulation"
					},
					"Key": "VRSimGrabComponent:UpdateManipulation"
				},
				{
					"Source": {
						"Text": "VRSim Controller Proxy Component"
					},
					"Translation": {
						"Text": "VRSim Controller Proxy Component"
					},
					"Key": "VRSimControllerProxyComponent"
				},
				{
					"Source": {
						"Text": "VRSim Feedback Component"
					},
					"Translation": {
						"Text": "VRSim Feedback Component"
					},
					"Key": "VRSimFeedbackComponent"
				},
				{
					"Source": {
						"Text": "VRSim Grab Component"
					},
					"Translation": {
						"Text": "VRSim Grab Component"
					},
					"Key": "VRSimGrabComponent"
				},
				{
					"Source": {
						"Text": "VRSim Interactable"
					},
					"Translation": {
						"Text": "VRSim Interactable"
					},
					"Key": "VRSimInteractable"
				},
				{
					"Source": {
						"Text": "VRSim Interactable Target"
					},
					"Translation": {
						"Text": "VRSim Interactable Target"
					},
					"Key": "VRSimInteractableTarget"
				},
				{
					"Source": {
						"Text": "VRSim Interaction Component"
					},
					"Translation": {
						"Text": "VRSim Interaction Component"
					},
					"Key": "VRSimInteractionComponent"
				},
				{
					"Source": {
						"Text": "VRSim Near Interaction Component"
					},
					"Translation": {
						"Text": "VRSim Near Interaction Component"
					},
					"Key": "VRSimNearInteractionComponent"
				},
				{
					"Source": {
						"Text": "VRSim Portal Base"
					},
					"Translation": {
						"Text": "VRSim Portal Base"
					},
					"Key": "VRSimPortalBase"
				},
				{
					"Source": {
						"Text": "VRSim Ray Interaction Component"
					},
					"Translation": {
						"Text": "VRSim Ray Interaction Component"
					},
					"Key": "VRSimRayInteractionComponent"
				},
				{
					"Source": {
						"Text": "VRSim Ray Interaction Example Component"
					},
					"Translation": {
						"Text": "VRSim Ray Interaction Example Component"
					},
					"Key": "VRSimRayInteractionExampleComponent"
				},
				{
					"Source": {
						"Text": "VRSim Spatial Input Component"
					},
					"Translation": {
						"Text": "VRSim Spatial Input Component"
					},
					"Key": "VRSimSpatialInputComponent"
				},
				{
					"Source": {
						"Text": "VRSim Teleport Component"
					},
					"Translation": {
						"Text": "VRSim Teleport Component"
					},
					"Key": "VRSimTeleportComponent"
				},
				{
					"Source": {
						"Text": "VRSim Tool Adapter Component"
					},
					"Translation": {
						"Text": "VRSim Tool Adapter Component"
					},
					"Key": "VRSimToolAdapterComponent"
				},
				{
					"Source": {
						"Text": "Valid"
					},
					"Translation": {
						"Text": "Valid"
					},
					"Key": "VRSimFeedbackComponent:PlayDestinationFeedback:bValid"
				},
				{
					"Source": {
						"Text": "Valid"
					},
					"Translation": {
						"Text": "Valid"
					},
					"Key": "VRSimTeleportComponent:SetTeleportDestination:bValid"
				}
			]
		}
	]
}